[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
3750
648
900
3370
6122
4464
7399
4939
3659
4811
5598
669
2465
2400
5560
299
2109
4893
4411
1699
1519
803
1635
6065
5998
1903
5445
1324
2376
340
4659
3800
5948
1460
1633
1985
6017
2614
1465
3961
4853
5393
2210
6250
5602
3700
5977
2799
4646
7539
4516
2252
7543
151
6357
619
3915
5410
7495
913
6093
5620
4128
5780
5915
7194
4149
3223
2073
307
1375
2490
2662
5491
4490
5296
5036
4269
2106
5858
5330
3686
1394
1667
6045
465
3099
5176
5430
2539
1866
25
4559
6038
4704
192
1141
1080
6248
3272
5028
1567
6831
4190
6104
3618
3374
2859
7010
1702
3166
2119
3530
3605
4525
6407
4822
1099
6644
5659
7186
3772
5510
5589
531
6637
1407
5619
2986
4480
3641
4063
1920
1722
1906
2515
23
5677
910
5689
5778
5736
4124
5011
4167
5310
1070
1767
2212
7377
5612
7509
2595
1018
1736
6835
3263
281
3809
5537
1363
1277
3220
3893
3743
4958
2555
2541
5566
6887
1871
742
2289
2107
2265
4969
3300
2597
6040
6242
5949
4151
4409
5057
512
1066
486
3870
1854
5096
4562
2313
7467
7261
7058
2828
7492
62
5470
3747
7346
4109
6508
5051
2693
2112
7044
5526
7239
3068
5702
6832
3661
6810
4392
1731
7123
2364
2489
2380
1679
5264
3694
4211
6734
3859
6333
6293
1734
6929
6630
6980
6983
4936
6759
3560
3568
2729
6286
1215
1344
1815
4576
6656
7305
1401
1913
4721
5530
7444
7055
1031
2770
761
5520
5284
2304
4231
3792
2538
3634
150
2549
2461
6501
1647
6641
4630
6101
3630
5037
2975
2087
5271
2967
1877
7370
2471
3193
1036
4498
4230
2410
4139
3038
4655
1859
3706
2827
3196
2621
5640
1362
730
4148
3154
4301
2197
6301
3433
4293
1779
1348
3000
3586
450
7039
6453
1279
6289
3335
6609
606
3780
6206
2147
3864
6770
5718
544
1334
1726
4068
623
4967
5122
2466
2446
7255
2058
4333
4216
2923
1641
2717
6469
2674
6713
4261
6405
6714
4933
5282
1264
4350
955
6822
2810
5450
2456
1271
5328
3578
1816
4499
2402
3440
3523
3317
4462
6920
4412
7309
885
6811
2786
290
433
4671
5192
6909
5681
2115
5538
7328
7449
7160
922
1844
5724
3692
478
2791
19
408
134
3397
264
6485
3067
3912
6654
2444
670
541
5787
7403
94
7349
5041
4599
1241
6178
2891
7212
5338
893
656
3976
4046
4326
3971
868
4902
350
872
4180
3018
6012
4321
4181
133
1610
2192
1952
4089
4173
7159
4417
4298
2463
2151
4233
2154
535
5139
6227
4117
6521
2685
4744
6352
1511
3607
2899
4407
6666
1605
2435
671
2226
2695
1582
7400
5397
4531
3585
3242
5178
4105
1580
1219
1258
6740
4125
2974
4923
2282
5864
5505
790
7256
2042
7486
4866
6966
1695
2522
3695
6569
2477
5165
4080
7154
5547
6050
4612
5955
4981
6919
4998
6088
296
6861
3504
4469
5889
3329
5906
5519
1571
2029
4650
116
965
383
2612
5971
4510
4430
1970
3461
6833
2021
4145
3765
3203
3648
4568
3137
265
4741
826
64
5938
6518
6846
5006
4396
1934
4355
2993
2396
5292
5498
3373
3231
7363
2121
2315
7408
4166
330
3901
3508
314
343
5698
6722
1660
2848
6319
3106
4291
6143
1457
4780
847
6886
2448
1999
5744
1146
6689
248
5497
532
2205
5708
5099
2004
736
2506
1227
137
3117
5235
1323
6014
5810
2990
3764
5999
5166
7037
980
6350
3770
5788
4909
3056
5920
1116
2970
3464
920
7528
751
3342
4986
7420
6535
5816
507
4653
3500
3012
3945
1283
7465
1592
4802
3007
5926
794
663
3824
1308
2688
1395
3937
6182
2255
2334
3289
3310
1919
1706
6596
414
7047
1335
6160
7257
5226
88
4553
584
419
810
565
4381
7013
1613
5988
4351
5521
5105
3495
1778
4751
5370
2984
4114
6043
517
7354
6798
974
4042
4819
1043
6854
1951
591
5413
827
600
4760
3019
5221
6902
7327
7006
101
2499
4399
1684
5909
6768
1924
2851
6220
3366
6678
4237
4450
1245
1405
2592
764
6223
6284
3731
3255
2738
127
7251
6985
7436
5803
3051
1724
6235
1351
641
1688
2968
4053
5251
2348
2007
5562
5814
4315
4369
138
1214
3477
2716
2331
5492
3725
4583
2835
4677
3084
4603
3644
7023
220
3017
3646
1735
2570
4768
1315
6930
1132
7366
2378
5063
5984
2918
1899
3396
3481
4302
2528
144
5081
3819
6165
2218
6962
1152
7134
5957
5791
7127
1629
983
5688
211
5179
6602
3186
53
1697
6751
2983
3283
4220
2838
293
6651
6163
304
1255
2769
5801
5839
5117
6973
3134
2316
6176
4040
5693
3227
6515
979
6977
462
7077
3377
6567
936
2407
6725
1170
4543
7091
3097
543
1379
3247
3364
1914
1879
734
7532
6027
7421
6308
6662
3128
1103
26
902
569
3956
7042
4542
5095
3987
56
6899
4036
6015
6695
6760
1730
4858
7373
4595
6560
2230
3501
5881
873
2367
3844
1889
6115
316
6552
6007
6003
7490
3529
2722
495
5389
7147
4202
2328
894
2131
812
6583
4786
2602
5854
2229
5860
5775
6314
3129
7019
3531
4287
6613
4454
404
4458
4779
3938
2505
1805
3654
4329
4340
4558
499
6908
5997
38
442
5511
3775
5603
578
69
4372
1991
3032
197
5623
5005
5288
6482
1247
5660
6663
7032
4648
431
1061
3130
1327
1292
1299
4021
7326
5466
1388
7344
4377
7292
7206
5168
2076
2318
3598
2283
212
3613
3615
1168
1623
1252
3665
5396
5882
245
2399
4163
2099
7330
6167
6968
7125
5617
3860
2211
3949
3198
368
4636
6972
5741
6639
1267
7219
6729
5243
5486
4223
886
2708
6588
1757
5239
3691
2935
6615
4403
1590
3270
4547
6362
1693
2699
3456
6940
1939
4921
3299
3873
5381
1622
6549
3090
2683
4130
1960
3120
5298
5385
4205
5436
6047
6543
6004
83
3107
4183
3469
36
948
443
3515
6631
2397
3226
7507
5335
5495
7458
4876
4354
3608
869
4679
3015
318
5604
3762
7445
7395
2023
6551
1205
2491
3771
1232
1154
5573
7371
1891
57
3994
1946
930
4003
5883
7078
2873
5395
1987
6986
2741
657
2776
1846
659
1274
1819
2642
4305
355
6875
219
3606
4842
1148
1250
3782
1616
5367
2434
4643
7029
141
7157
7180
5422
1793
957
2495
5305
677
6674
1936
3418
7025
2484
4203
3070
1670
5606
3484
4544
5594
2181
5089
7121
6193
6192
2663
4894
5480
5936
4120
5678
6890
6587
1953
6758
6066
6888
3066
1715
7250
652
7254
4413
6390
1129
729
7117
6063
1006
3148
3577
6649
2847
5822
7393
7533
7033
4641
4118
3021
6149
7059
5194
3088
1370
5658
2502
4587
2745
361
1397
3442
5935
4214
5482
1814
3155
580
6671
632
5731
29
349
2060
3783
3811
6393
3436
1121
3040
4378
2145
6959
4691
781
2919
2727
1972
463
932
2795
78
3062
7546
6046
1746
3466
6221
5647
763
583
4491
7329
5821
6905
6917
5109
3151
470
6417
7311
3213
5278
6625
2124
4270
1518
7419
2594
5493
1361
2012
5649
5484
2766
2512
5169
3172
6243
6881
4486
6444
5472
3159
2221
5229
1110
993
3744
3479
445
1750
1698
3703
3055
3104
2411
216
1743
1386
2655
1782
7137
7038
2080
1078
5705
382
177
2196
4628
5426
3400
6704
3720
5610
1500
5535
405
5203
341
5574
4199
1569
5631
1302
2936
3039
5322
5555
5402
2130
2028
6981
2035
4122
3354
2610
1744
3112
6898
7110
3168
5202
2646
7447
6079
2164
3943
6296
100
2576
5695
2730
3482
1865
4065
2524
2024
45
2393
7045
1963
252
6356
43
6542
1907
3506
3257
1941
5950
4683
686
6447
796
3215
5525
5134
2091
180
7075
6748
1618
4778
4993
4941
1081
4829
811
4482
6788
2421
7544
3813
415
3126
5663
4626
768
6325
628
3651
1294
5600
3766
6127
1915
4987
1206
1956
5121
4832
5648
3189
6862
2511
3312
2910
5986
5870
6236
903
6078
4693
6682
292
2429
7129
1390
7192
13
2768
317
518
6037
5964
1425
5333
3080
4784
5380
2415
5872
84
4289
3030
5277
4861
832
2267
998
1545
2279
1389
5739
1100
6111
6298
5295
6389
6894
5728
4590
5502
5085
4005
6992
1829
1732
7387
750
1566
5536
4974
5064
7378
5160
1995
2423
2354
5289
2749
5056
4225
1459
4218
7122
2437
5683
1853
6965
851
7451
1833
6864
157
366
5190
5474
1515
2931
3955
7360
4848
6493
2120
505
654
5850
5644
889
5847
1014
4851
2626
3103
7144
239
3650
5770
1516
5374
848
4017
571
3438
4123
4976
7152
4030
2198
2480
3318
2879
3705
5416
6658
1270
3793
5513
7541
5369
634
6994
7106
182
5799
2329
2842
6324
2274
5716
7548
18
6203
4505
1160
6571
2022
1508
3324
5234
2370
6139
1242
3836
1151
5613
3285
6414
225
3512
5504
938
4686
2771
5153
1777
7527
3681
58
5469
4260
2046
6346
6600
3073
2346
4592
566
4245
3724
2525
456
3182
7295
3268
1211
384
3878
1839
1721
1542
339
3049
4106
3966
5217
2483
208
6398
1775
3711
3343
6265
2049
2234
4781
5076
3563
6375
5208
420
5899
7394
879
1620
515
7477
856
1965
2866
2841
5968
4144
3170
457
760
2656
6683
4988
2030
3209
986
6164
1640
7028
2047
4699
2248
1166
2603
6906
4448
7051
1885
5184
4324
4375
667
5399
3053
5488
7317
6441
3248
4917
5777
6360
1835
3533
1158
4878
4874
1883
1057
660
482
7213
4906
6119
2214
2127
6175
4836
6445
7383
5026
1291
2976
676
1402
4002
5651
2275
4150
3503
3818
2519
3407
1087
4429
3319
908
2785
2473
4022
5694
5254
4597
3004
3749
1176
5621
7475
4108
2564
1304
5361
2070
5804
1758
4334
459
2998
4927
6283
7362
4743
2474
4188
1832
489
7148
3472
2068
5144
4971
6327
4257
3309
1588
5793
5459
5281
5411
6133
4061
2379
3627
3978
3238
394
2273
2667
4718
6511
2908
7513
6311
2647
440
2327
4758
2702
1480
4335
6889
3362
1855
3414
4662
788
2369
554
3784
4337
5257
4018
513
6011
2487
1022
7008
3988
4700
6956
2728
4278
426
5514
7088
3111
5242
6158
6272
3430
4928
3444
4274
4801
853
2556
1265
1174
7479
3689
5917
672
2563
6575
7062
7000
4436
6267
5033
227
2762
802
740
3620
5297
3583
4475
2620
2867
6141
4680
347
1060
247
6996
4386
5347
777
4097
4794
1360
2942
2638
3359
791
3576
2709
4567
7069
5624
3718
5542
5477
2862
6574
6490
6287
2732
3717
1111
5004
4176
6396
4934
1452
5811
5316
1977
7111
5468
5348
2648
6161
6817
5052
7238
4152
6252
778
2439
7164
5785
5918
6640
14
4831
496
4249
3740
2233
7417
1325
5886
4841
2420
5922
4657
1603
758
1657
4478
4871
1289
4719
3360
6402
3489
2406
7175
3110
5834
2272
4750
1343
895
5247
945
2820
5931
1320
2979
572
7520
3842
1514
1827
519
5591
1818
3212
5501
5125
1076
1268
4536
6474
4968
3158
6454
1656
194
6825
2458
60
3349
498
1428
5684
2586
5034
550
5269
2639
485
2453
6680
2988
5391
1737
4070
7234
5638
1471
3742
4709
238
6234
5406
1638
2686
6802
5368
6318
1122
6337
5641
4119
3351
4153
1696
7462
6818
2428
646
2756
1858
3173
1220
2818
7224
4732
6738
2680
1764
4366
5306
536
1350
6895
244
1565
6976
3899
2582
6427
1964
6054
5017
226
6681
1564
2558
5308
4775
2772
1352
1008
2188
951
6780
581
2479
4431
3420
4402
5746
6754
2019
1981
2425
4083
2644
7375
6512
697
5581
2382
4052
1917
4276
3181
645
5136
4908
3921
136
4007
5753
6946
6819
1112
4280
5047
6610
3545
4835
203
2185
5823
1504
4285
5189
4728
3059
2330
4970
2682
746
6431
2290
4675
1973
6380
5709
4191
3851
4374
1474
3125
7510
3982
4157
3344
6144
6000
4930
1287
3005
5438
5383
3745
4960
1587
6087
6211
1107
6391
2169
3886
3036
978
7016
5928
816
3336
7109
2179
2914
4515
1783
2987
4479
631
1760
1096
5773
2247
3425
1986
4232
2567
5087
2431
4707
3095
5592
523
1184
3781
3727
455
2350
4736
562
6916
7210
1396
5656
3580
289
5824
6947
1604
5686
1090
5776
6423
2999
3267
1550
167
8
699
4560
1314
4077
2740
3161
1391
4466
5961
3821
4717
2055
6897
4439
5972
3290
4460
2591
5213
3845
4929
7207
176
3657
6922
5000
7196
7043
7241
6471
2363
561
1419
5815
2526
6928
7454
4690
4275
4951
843
1536
2673
3152
3517
490
327
2514
5206
7017
3679
3338
4267
1842
5884
3626
6355
6171
3093
3150
2540
452
3544
5691
4922
2017
3147
5572
5420
2508
4313
3002
5532
5371
1050
4082
3934
1243
926
3795
4762
2831
1073
1127
5862
1497
4782
7156
4989
7097
785
2005
6800
6635
7540
1266
5979
6781
268
2863
2011
2893
4627
5423
560
970
2566
7265
1606
5929
6892
4357
7335
5344
2438
6565
1950
2190
1678
2724
7525
5868
1195
6016
5475
5960
1424
3923
5969
2366
2266
1373
5127
6387
1690
2202
54
4729
6855
5769
1888
6295
4582
6134
3326
6842
4796
732
3435
2572
6507
7496
1719
6720
2530
4265
752
4461
152
7512
7452
1435
1295
6057
1142
1540
5233
4006
5954
6256
1002
981
5214
3167
3266
4767
4912
2804
5200
4695
5618
4194
6504
5937
5182
5907
4745
2209
3643
715
5118
3455
35
430
4169
3253
6430
4034
4614
881
6108
438
399
4310
6487
6500
159
4090
5529
795
5720
4493
7222
7483
3778
6036
1791
5360
743
3327
3207
1755
1718
2293
338
592
4761
5215
4512
195
1892
3079
2857
1013
6436
3914
642
1510
3554
418
3992
1902
6694
4442
2995
1047
1092
1780
3232
3020
218
2144
5900
1453
7426
6750
4748
711
6730
3614
3403
5552
6799
1431
7339
4814
5050
7391
6055
3200
3905
1440
1631
6608
4255
3603
6472
7245
2876
6562
1741
1940
178
4356
5940
7183
6838
3868
817
4757
6621
5956
3729
3177
6829
4985
326
5273
7353
878
7169
7380
7150
5869
5571
4873
1619
859
4506
4476
4380
2103
3951
17
6197
6971
1200
2761
6510
7493
300
5518
2351
4444
1124
950
2136
2734
5212
5715
1556
2852
4066
253
6796
1905
2691
6764
5020
3113
5467
757
3952
3528
234
3850
3494
240
1260
739
7098
1671
1023
7208
3983
1065
1745
7225
2260
6582
7197
228
214
4405
4500
611
789
7529
3385
1042
5274
6513
5792
2710
1916
6702
156
1651
4991
413
3910
119
2341
1071
89
6303
4504
3662
3647
1502
6815
6189
3649
1164
3716
2178
1086
6032
2714
1297
2924
7404
4323
6870
5690
7300
6347
4358
4940
2240
128
4004
4887
555
5156
6690
3280
1868
1423
3977
962
3262
2138
4862
4742
3946
2345
6517
3925
2468
4055
4408
5003
6830
2139
5636
5673
7226
7001
6804
332
5714
1221
2713
4611
354
4766
3141
1251
4382
1191
4556
3345
988
2581
6914
7453
5340
1273
3856
7015
254
3371
2832
2140
6675
1769
2394
6056
4575
5258
1332
4914
5632
266
2631
2236
1838
5442
2231
5255
6254
3918
7299
7272
5398
5595
839
4031
3617
6467
3054
5635
2056
4262
4514
4651
7131
4234
3610
2172
2739
5548
337
230
3313
3411
780
2156
727
1639
6198
7410
3052
3273
6364
6784
4777
112
1326
6757
7034
3855
891
6989
6570
2653
7501
4896
3225
741
1416
964
5315
1140
830
367
6404
733
377
1609
3897
4973
7170
3096
4509
320
6812
5668
5317
145
5894
22
6335
4731
397
4715
5177
5082
6199
61
6059
2945
529
1928
2422
4961
1105
411
1691
4623
5974
2925
5723
6893
3848
6135
610
4555
2562
6067
7464
403
7116
3447
6377
7096
4720
5092
6386
122
805
476
5325
469
3941
5895
1547
1163
1278
2307
1364
149
1826
1449
1822
4624
1645
428
956
2054
5379
2044
425
473
5861
5865
1627
1055
2359
2561
3416
3631
2958
5512
187
6151
4864
6244
6941
5970
3146
373
500
3451
3622
7505
724
3121
3758
3998
1306
4012
3011
2069
6338
3917
4903
315
4615
1072
1538
3233
2401
3807
2064
5829
285
4440
6277
1486
5752
2964
5228
7086
2875
4949
959
5614
336
7190
2000
3294
4716
1579
7282
5205
4353
2571
4548
7442
4497
3825
5697
854
1648
5129
7424
2356
533
3306
4660
574
5094
3969
1848
2874
823
1984
372
3022
7168
4565
6845
975
3320
1347
7333
5873
722
6379
6949
3732
3999
162
2598
2457
2972
7534
5429
3866
4771
1068
3746
939
6473
7350
301
946
3406
5
6633
3721
2523
720
6591
2472
6094
4549
907
2950
3304
6062
6636
7310
6878
2189
2629
5813
4410
76
1235
7031
6450
4889
1598
4652
7289
6424
1102
6749
6126
2237
1694
5892
6307
7491
449
6329
6718
4911
6257
2098
3057
3565
6769
1831
5392
1171
3459
5941
6142
360
6266
5418
1958
3929
933
3728
5876
621
2902
3521
4956
3664
6932
2288
5433
6753
6262
4658
5059
395
1341
6807
3676
7185
698
2547
3194
577
1614
1733
3254
235
6083
6937
2391
1234
5133
4843
3108
3869
6292
2778
2917
7012
297
3986
257
3265
7515
2604
3127
5607
6085
3567
5578
3536
4799
2358
7368
682
5456
674
4172
6790
1676
2798
4950
679
5540
6611
3668
1044
2228
2513
644
6660
2721
3483
1563
804
5634
4557
949
3271
5840
3829
2299
3973
3894
5903
1870
5010
6771
960
707
2809
5874
1411
2141
6809
6762
1959
1509
207
1529
2132
1248
564
3562
103
2447
3653
1787
3346
6848
1089
1451
5071
3083
7440
40
710
1931
4096
1849
4093
5417
579
5074
6497
7214
7361
5762
6435
5963
1544
1406
4872
4574
7381
3683
2310
6840
7411
3144
1938
4852
3595
2102
5287
1727
713
2636
1728
2901
1000
6174
3328
4258
5596
762
1208
5580
1417
6852
4451
2027
3990
7423
181
5137
6850
3109
1710
2170
852
1033
302
370
6684
4924
2705
1901
5887
7306
1716
806
6557
1669
7162
3340
6128
770
429
1489
2381
6233
3445
3
3258
7188
7422
5107
850
3670
2765
3871
7223
2284
6847
3131
5115
6697
1307
3907
4578
7469
3572
1792
4299
6020
4048
1199
6545
2337
2938
5719
7531
1339
5362
2253
1366
2929
5123
5674
6868
1309
2814
3518
217
447
3628
4517
4273
175
324
6924
4996
6522
5471
7181
468
5921
2
7216
1811
5901
6785
4295
7046
4606
6491
688
1180
1441
901
6506
6113
5013
3975
2419
958
2510
3723
4763
3311
2374
5856
6882
753
1179
3779
5210
7318
2239
728
7523
3812
604
1650
3965
2249
7202
5093
1674
2123
67
3714
1890
6921
6988
6348
4712
5293
4722
2679
3216
6
125
6214
3277
2531
2930
5405
622
1878
1045
4300
1182
2781
6116
5382
586
6563
797
1595
1173
5018
1966
2067
3160
3558
896
1384
2232
1298
7446
1157
115
72
5106
1466
6900
3023
5733
1275
323
3415
2892
6328
81
4168
5751
4776
6237
2285
2706
6156
3655
6181
7494
4999
2220
5932
4416
5114
174
1608
4078
551
5256
835
2956
875
5008
5149
1682
1532
927
2478
4390
2939
2652
2985
4870
5533
417
6866
5404
3047
1212
684
7277
6185
2038
1874
3889
2640
2250
5951
98
3900
7294
3903
4640
283
2812
2485
3334
4164
3391
3427
6091
5001
1433
1082
6733
4992
1482
110
651
1643
1010
3139
2291
1093
6191
3487
6661
2787
7093
3960
1038
6279
4788
6023
2504
2669
2689
3754
2905
1812
5337
887
653
483
4702
2565
5478
4676
59
1661
2166
3814
4175
912
5687
1751
1525
5431
386
204
4522
6231
2937
3833
5601
4155
6782
1685
2278
6229
2911
4916
6843
530
2194
1172
5452
6313
2692
250
5546
3499
2947
4824
7312
6460
1128
479
5311
6238
4817
378
4696
3698
1272
509
6455
2944
7405
1900
5754
5797
5549
6594
7061
2953
6958
3667
233
709
7285
5978
5097
3426
1358
2703
2224
118
1546
5952
1823
4437
2045
1948
693
7519
1978
3443
3526
7535
2268
5848
2006
6618
3940
3542
1004
7301
3046
5779
7179
5171
5241
4014
1753
4059
3462
4730
5476
5738
4584
6580
1921
3734
5261
1067
3854
3153
5487
5088
165
164
5650
952
3570
6857
3006
6140
4419
6316
6369
5461
106
5796
1599
2113
4821
1594
3756
1458
1496
5517
2321
4015
5622
5186
4759
5556
7094
700
2167
2965
1481
1041
5352
3325
4854
1961
2752
5527
2796
7332
7084
5147
3449
2634
3592
7498
107
7459
7345
7514
4790
4239
4
2665
6334
1809
5494
6099
6147
1414
1700
4774
3808
4304
3557
4494
3947
2297
4250
1478
7050
5902
7074
5758
4789
246
7542
943
3297
7342
5152
3348
681
2395
3063
1084
7499
2105
6896
3003
4812
2339
5174
421
3275
2616
1108
2389
5575
1398
1196
2032
3383
1522
7215
2117
5637
2008
4263
7275
2057
1923
5819
731
213
504
2182
7288
5120
3251
400
5947
3428
4572
5039
6153
1909
4642
4619
553
5885
74
2390
3044
7149
7060
95
295
6805
5019
4982
5608
5545
3805
3408
3571
5207
2834
7336
6406
3474
2496
2529
774
2254
3596
5544
5032
844
5993
1296
1856
605
5079
963
3485
502
1864
6294
1028
4880
635
2432
7478
4667
1367
7545
1840
4954
2641
3984
6370
1378
620
3157
6385
6679
6939
385
2227
5286
6275
6787
4837
2615
5703
4420
5628
1165
3081
838
6481
5506
4279
4110
4856
3797
2455
7100
1383
3722
6084
6304
4423
6533
5191
198
2033
2963
2864
2527
3368
7163
4793
3392
5270
286
3376
158
5443
2946
82
5113
1413
3822
5783
1555
7412
4397
558
7313
6408
5197
4198
5040
2596
7537
6372
841
5366
7448
6219
612
6659
4739
1615
2632
6400
5223
7120
6107
2559
2163
5657
7243
708
4705
2583
6264
2940
6462
2966
3308
1485
6998
1256
2223
3882
4133
6031
3776
6100
1662
3535
4975
4897
7461
3249
3190
3696
1186
1880
5835
3785
4879
4428
4342
70
3234
4035
1056
1461
2811
5183
831
6463
2780
2623
6259
2168
1861
2036
7118
1720
5054
5995
4875
1126
643
1353
1993
3767
2550
3967
2915
510
4297
1749
4178
5851
5563
2535
6475
2336
2507
6002
5939
2039
1976
2149
5781
3733
4749
1225
5263
755
3763
1630
1794
3957
1442
7067
2951
5387
2897
1725
2440
104
779
3087
5696
3058
745
185
4957
7303
6696
6026
6064
2637
4131
6786
4051
1664
4963
4221
3496
4088
1908
7365
5111
24
4596
1083
1467
6483
6345
260
168
424
2855
2079
4545
5128
4978
453
4844
5625
2996
7177
4521
6874
171
4094
2659
783
5567
407
4638
1573
79
2470
7103
345
2922
2800
4907
1175
3184
4081
4580
7171
557
590
3625
6828
5825
3931
3217
6539
782
602
7101
525
6918
3534
16
6960
1543
5962
4826
1517
1828
2065
944
3959
6821
7500
7227
191
7286
2912
1873
863
7036
3179
2043
1752
6974
6667
3769
545
4885
691
7142
540
1761
7176
2894
7364
3419
6013
6546
6712
4834
6365
4395
2347
5131
7414
3315
3753
5732
4995
99
4171
7409
1763
4266
4966
7203
918
5890
2973
2613
7191
5162
169
714
4534
3219
4944
6150
5942
3115
1882
539
416
1188
673
2599
6358
5990
5669
2081
615
4363
2568
3710
6616
232
916
4327
6439
3412
3286
6544
1432
3936
4797
2978
4103
4487
3393
2606
6162
261
3708
2751
3132
1742
4895
1040
5193
6531
4215
6954
4809
3243
7066
6418
940
4513
3804
2775
1409
4050
3208
6239
123
7530
5259
7236
2129
52
1974
2575
2672
1032
3379
6232
570
2503
1686
4137
5424
358
6556
75
2089
4529
7184
6058
6392
6429
5944
3086
1005
5652
2460
1007
6534
994
143
5246
2100
277
6727
695
1410
6686
3827
7304
5349
1475
1576
6323
2146
1666
5415
6486
3331
6388
6622
7266
2789
6001
2162
2718
2320
4689
2025
2707
3061
3933
5855
1570
369
5376
2830
7187
2187
4492
3025
4639
6039
7115
2332
501
5067
1189
1336
5407
2449
2241
1559
690
3048
4008
6188
3911
2955
2155
5457
6614
5898
5421
4663
1713
2607
4467
1030
3246
1426
5444
2880
3045
5048
124
5806
7473
6103
6326
196
582
4610
448
1492
2219
2992
5262
599
2546
4581
3034
2257
5195
5561
4079
1236
4935
3974
4850
799
48
3735
6646
6632
5761
6527
1652
4918
7470
5981
3375
4314
3693
5727
6249
1201
5341
3806
1801
6415
7341
6155
6129
267
967
3078
4882
2096
5388
864
7124
6883
6033
3611
6499
5154
3541
3492
288
1436
1910
4538
6595
3178
2003
6584
4177
222
5818
3801
6359
5151
6090
6834
6502
7228
2404
3218
6130
3922
4206
6166
6019
209
1400
6110
5237
3457
1246
5713
1575
7334
3323
5692
4827
4752
5772
2152
4530
7248
6112
4424
2063
1672
793
4288
1281
5086
5022
5353
7014
1285
1935
3413
503
888
3538
4681
3071
2110
5409
4189
4507
7356
2195
7441
2413
2183
2160
744
7235
2426
6190
492
2492
2664
5653
1796
898
6096
3876
7369
4000
3857
3604
6904
5959
637
1625
1768
6461
837
3847
6420
4062
3192
6744
1162
139
2486
678
6204
4919
6255
3826
5201
312
7389
6664
1887
432
6154
1149
2980
4528
5807
5857
93
2793
6528
4254
3522
6035
6041
4060
5812
1328
1456
3788
5774
5933
5679
4433
6218
3369
5667
5680
202
344
1847
1954
6200
3468
1178
117
3537
548
6564
7536
3010
6950
1046
5249
4383
5808
2026
3042
5605
3561
704
5304
3669
6225
2352
5924
2200
6488
2078
2712
4649
7406
2927
6955
4942
4243
1527
4926
4376
4449
3964
1357
472
3581
7517
6477
1860
2957
6858
5685
2398
4165
1943
1843
1305
6049
5102
2701
4654
4694
5155
1254
4185
4635
3602
4477
6247
3228
3075
4607
2774
1377
3624
3794
303
6912
2657
3347
6434
4984
4364
7141
2758
6576
4074
1382
996
617
3493
7274
7258
3041
941
6022
6820
1387
5276
1677
4604
2731
2225
1925
6708
2670
1533
2819
2806
32
7200
3136
858
6240
4368
5551
3388
6957
821
1365
6726
7182
6877
7252
1557
193
3707
5163
1313
2794
4625
1632
5108
924
917
528
3507
7049
4937
1404
3547
4962
7048
3065
2114
1988
42
2587
6121
4979
976
7189
3924
3954
2943
2878
4898
6195
6526
4343
5717
2933
6931
461
4348
3549
2309
6102
4311
2243
1654
5541
389
6371
7114
435
987
588
7151
5905
1499
4618
7398
911
534
1097
4983
1190
3573
4341
4229
4041
3566
201
2031
4539
1537
1037
2649
1658
6561
1810
1109
5666
1230
4016
4585
4159
6529
921
6746
1493
20
845
7229
1125
3736
3591
7508
953
3551
4422
5272
4997
6867
1088
3454
2048
1637
765
5836
706
6739
6401
6624
1802
3016
5927
721
647
573
7244
1872
1642
1572
359
7064
6184
3791
5080
4025
6428
3239
4901
1216
5584
4723
7135
2754
1894
4953
4550
5615
6741
1634
5481
961
7230
7516
5805
357
1059
6331
3838
4033
7432
1601
5266
3240
3188
4783
10
5896
2521
34
6194
4533
4196
3757
393
1817
3556
2126
2443
4904
147
4174
5609
1177
2083
1159
3423
5967
1130
4158
3237
607
1740
1857
2409
1636
4401
1346
4142
1867
890
2601
862
2408
5384
1837
6263
4714
1851
4242
5994
4756
146
1003
1213
4312
305
6880
3550
5225
4865
5671
2537
4884
6520
3124
6117
3680
627
3867
1290
5664
7138
2697
6458
6105
7081
1209
4569
1712
4365
870
5646
3660
5425
4385
3140
6440
321
5342
5016
5062
749
1789
4186
3409
4098
1218
242
6366
3206
4026
5786
2534
3958
6525
3666
3417
4001
4038
5586
6217
5219
2335
4134
2840
4347
5706
613
4349
2261
5735
4785
718
3116
3332
3597
3588
3453
1535
2849
4857
7158
6074
973
2733
231
1611
1422
5722
668
3875
7
1762
1541
6736
1506
587
4092
4932
5725
6601
1421
6177
6341
7140
365
675
6604
3357
2635
6590
3013
7139
6936
6397
1012
7237
7416
7502
6208
4737
6261
6538
2737
6124
4682
4481
1646
4344
3260
346
6871
1933
6961
189
5755
798
3633
3394
1490
2377
7056
2898
2134
1257
7022
6677
3908
2952
3511
2609
3759
6773
1445
1863
6806
1443
6514
4740
866
2755
65
2088
2627
2590
6028
3935
4485
6503
5303
1342
5500
696
3991
3381
3579
6952
190
4049
2821
2675
142
4362
3204
1053
3527
3105
4990
269
50
822
3072
2111
1593
5503
4200
6309
3843
3321
5483
1596
3175
135
7005
5507
5672
5820
5198
294
2822
3450
2493
2797
2735
4473
188
685
6910
5485
6791
4011
4633
2014
6628
3682
173
251
4069
5795
4361
7119
6097
1628
3008
7089
6246
3138
4394
6765
4501
6665
5943
6607
3677
5042
2690
6685
3673
6071
2482
1711
6993
2720
4240
3390
4678
6775
3895
3944
6278
7260
7080
2319
5965
6984
4746
1161
1707
3037
4938
1898
4713
7347
2412
4338
5676
1770
7068
1578
1192
5354
390
5175
3363
3690
3645
6409
5279
6647
4846
2150
5642
3786
4899
1450
5058
5142
5053
7146
3211
6849
6480
3100
5434
655
2605
3828
322
131
2174
5170
2053
2805
4328
2815
474
6120
4389
6496
2259
2557
6030
5661
1039
7472
999
1074
1185
3509
1498
215
2015
2890
6411
3183
5312
6987
5138
31
4674
6839
5432
2333
4306
1434
6793
4591
5534
1617
3553
4438
3229
2773
206
1487
5350
6844
5453
2322
833
4474
1714
3559
2469
968
5867
3802
4084
5250
2302
2368
771
33
1075
3927
256
1399
2869
3480
1893
2464
1034
7526
2900
6999
3834
4072
815
909
4726
2311
3993
4071
6865
521
4359
7220
6505
929
2608
7488
3135
4360
1549
3398
6209
5049
4613
2418
1337
3287
1319
3919
2816
3741
436
2928
471
6437
5309
6813
5729
4920
1975
1123
6024
5238
5831
4058
563
4204
4009
3865
2856
3314
6479
5372
5280
1330
6717
6395
2759
4588
2886
2441
5024
2868
1558
120
1881
6470
4608
7315
3930
4445
6761
111
2611
2618
1852
4830
1703
2405
1912
6207
6300
813
6212
3519
4798
6226
6363
4384
5734
484
6705
972
5465
4644
3601
6373
7205
4085
4489
5579
6605
6789
2668
6082
2497
2262
1776
3205
2542
3890
51
5323
7270
255
480
2344
2961
1203
3575
6653
1754
3840
5451
3486
6648
7511
4773
97
4027
754
4136
5355
1781
3441
594
6970
5173
5265
2750
4107
773
6752
108
6827
2850
4634
6443
4045
5524
329
2643
5794
7291
1001
7437
6756
3156
3060
4888
786
5490
6944
568
6933
2175
3684
2817
2823
6703
3145
840
665
2746
6676
7323
3024
0
102
1505
567
7054
6963
1528
6081
6269
3970
2424
7337
6755
6068
1834
3091
4426
434
6048
608
3448
1118
5187
3122
4247
4179
1472
205
5496
6540
2092
7024
5645
2326
3688
2871
1491
1937
5412
6568
3082
243
7007
5832
7217
846
3525
4047
2051
966
2118
3341
7302
5143
5879
2654
5707
3372
7092
7143
170
2954
3291
5528
2962
5817
1293
2907
4415
7463
2481
4825
1147
5577
5313
353
3439
4828
2676
5987
1597
1996
4632
2843
376
77
1979
3730
4815
3748
3926
7201
4905
4414
1237
2305
4765
2895
2016
3799
2186
2340
4387
776
2916
6824
4121
2861
1222
4102
1368
5845
905
2361
2436
6532
1131
4600
6577
4253
460
934
5675
5364
6260
4452
2536
6138
925
609
626
2372
4855
2569
2711
4101
4943
6213
6315
5539
7133
5038
3968
475
7307
7132
7476
3751
5148
3637
282
39
5065
3452
601
6339
6803
291
559
1113
4309
5314
5643
6336
3962
6797
4210
1922
2462
3195
4336
3316
3386
1520
2836
2158
4727
1240
114
4869
6383
860
493
2303
914
451
3470
3142
4668
6524
4839
4248
1962
1808
3353
3803
5893
6368
4115
1804
7297
1845
694
2982
2882
4964
6634
262
6010
467
6776
3963
855
1591
5386
3410
7130
4552
2159
5164
5784
6766
2018
1765
5670
2137
4443
6763
6344
664
716
1321
6114
2624
5740
1689
1709
1484
5553
6698
1183
6465
928
1772
4687
882
1507
4146
4915
1261
121
6131
4573
6476
7242
4320
4602
1944
2034
4593
800
3187
630
5299
2826
6276
834
7063
4800
6251
3539
1408
575
1249
7522
1488
7413
5002
3817
4318
3820
1204
5569
985
1957
6086
4453
1895
6935
5378
3244
161
402
1581
3303
5742
1444
7273
5329
4425
7218
4091
7372
5934
625
375
6498
7107
2009
6270
5390
3546
28
4948
4684
4537
4860
2476
2001
1312
6953
6826
5919
90
5343
44
7402
784
6901
4733
5199
2452
1875
6044
4804
1069
488
5904
1501
3985
4735
3760
236
4195
3879
3543
7087
6836
3839
6808
3656
6456
1133
4849
3671
5946
1683
2909
6343
4579
4551
5030
2645
2050
1427
6516
7172
4666
2206
3642
2577
5319
2417
6872
308
989
650
769
5248
2573
4421
388
2552
6489
801
2981
2837
5103
3230
3118
6975
2553
3995
3638
552
4292
3584
4457
96
410
5973
4502
5771
6230
6923
271
27
6095
5327
6555
7376
4064
7041
4747
1430
6691
374
1788
7262
1282
1310
5294
1930
2177
735
3906
1797
4754
6891
3877
348
3050
1393
6572
2725
5172
5075
6310
7287
6034
1824
3587
2386
237
2085
2904
4706
3029
4235
2651
5849
1020
7538
2281
7549
241
7030
5035
4319
2520
6422
4264
371
640
6179
5318
6299
7503
1187
6873
2037
5359
4303
661
6492
1748
1354
4772
6742
1904
4791
2625
392
3849
63
5021
3858
4980
7174
273
5458
4182
6042
1830
210
4398
5073
1349
6774
5358
6801
649
2459
7351
2960
1862
6687
3726
3678
2292
3339
92
4972
5700
4629
3288
5031
4170
2760
2753
86
2403
7322
5759
1560
5626
5267
5230
658
6554
6201
7407
6586
935
6876
2678
5112
5852
1359
5275
1687
725
1439
1446
6942
7104
1420
1098
7165
2084
4039
3014
2885
1167
3475
5196
2813
5365
4913
7040
6495
4138
4532
2360
4075
437
2949
5557
511
2451
5414
6317
3174
5346
1318
4616
6523
1983
153
259
5045
5222
310
2387
6553
7002
6468
6098
4212
705
4886
5757
199
4563
6351
4823
4527
576
7325
6642
2245
2264
3953
1723
2932
1202
2276
3077
6268
4251
7278
6743
2258
1503
7429
1224
1135
5682
5463
6879
2040
6593
4283
616
1150
362
3467
4099
1438
4947
638
5437
3069
5180
5878
1021
4331
160
766
2430
7518
969
3863
4054
5701
1114
1649
4044
3639
3382
4900
4511
3387
3874
6711
2518
2199
2467
6851
2742
5866
7482
6273
7249
7397
3389
598
4803
5356
595
3672
3861
3629
3432
4222
5077
589
4154
129
6354
1552
7390
1
4965
3222
5830
2671
3702
2142
1530
2948
2280
4162
1568
319
2338
5268
629
4252
7358
5629
3498
3640
3293
6907
6425
3350
7004
3989
7415
3892
5665
2989
2433
7319
3701
1464
4601
1644
2263
6859
618
3555
1967
2246
5245
3302
7072
7211
2921
7418
66
1429
1372
3123
5611
7020
4518
5711
4332
865
4087
2694
4286
2881
522
5976
4388
3612
4656
6109
787
4818
2700
537
6442
6548
3434
2128
6222
1238
2589
1945
692
7193
298
3085
842
5516
4346
2516
1052
5599
68
6145
7268
819
4019
4945
274
6550
4488
1926
506
7382
5236
4339
2215
1820
4838
306
3789
7253
6623
3402
6657
2860
3199
4140
2600
5756
4056
5587
6353
6558
1269
3520
2767
7085
3264
3089
3600
7204
7401
1138
2844
931
6823
1403
2180
4076
5846
6652
3663
6619
4994
4701
6700
1119
6215
6969
2442
1584
2216
3564
6349
3675
807
2122
3074
2854
1009
1229
5224
6948
4540
7367
1886
4813
1911
7521
224
5782
6599
6767
3979
2588
3250
5232
6592
71
524
2617
2888
792
5875
6410
5888
49
5809
2579
1495
3632
1574
3593
2314
7145
6170
2532
5253
1095
1369
7481
3738
7269
2744
4977
7352
2165
7280
477
2548
6645
3773
1795
2997
5853
5447
5394
1773
4495
3798
4890
2325
4883
6716
7487
4100
2375
5146
7348
5373
3891
6330
1836
2002
6927
4244
4807
4161
6449
7246
1329
3171
3490
4724
689
2143
5240
6853
1244
6399
2251
4024
5244
5991
37
1155
748
6547
1798
4370
7308
6672
6186
2388
4810
4043
4393
7076
6814
6367
4192
2324
1418
4524
7343
5015
3885
6413
825
1094
2357
3810
6061
6146
6446
4577
3191
3704
5859
